date_tovar = {
    (1, "Чай зелёный", "Вкусный чай, всем советую", "грамм"),
    (2, "Яблоки", "Зелёные, душистые", "кг"),
    (3, "Помидоры", "Советую всем!", "кг"),
    (4, "Конфеты", "Лучшие", "кг"),
    (5, "Дюшес", "Пил в дестве и сейчас", "литр")
}

date_magaz = {
    (1, "Порфиль", "Днепровский", "89004567845"),
    (2, "Сигизмун", "Версалькое шоссе", "89007894564"),
    (3, "Ваш выбор", "Фыпское 6", "89995554411")
}

date_zayvka = {
    (1, 1, "10-10-2021"),
    (2, 2, "11-11-2021"),
    (3, 2, "12-12-2022"),
    (4, 3, "01-01-2020")
}

date_kol = {
    (1, 1, 10000000000),
    (2, 2, 132),
    (3, 3, 432),
    (4, 4, 5000),
    (5, 5, 848484)
}

date_sostav = {
    (1, 1, 10000000000),
    (2, 2, 132),
    (3, 3, 432),
    (4, 4, 5000)
}
