date_tovar = {
    (1, "Чай зелёный", "Вкусный чай, всем советую", "кг"),
    (2, "Яблоки", "Зелёные, душистые", "кг"),
    (3, "Помидоры", "Советую всем!", "кг"),
    (4, "Конфеты", "Лучшие", "кг"),
    (5, "Дюшес", "Пил в дестве и сейчас", "литр"),
    (6, "Лапша", "На вкус как йогурт", "кг"),
    (7, "Мармелад", "С Кавказа", "кг"),
    (8, "Молоко", "Здоров как бык", "литр"),
    (9, "Вода", "На вкус как вода", "литр"),
    (10, "Апельсины", "Как в Африке", "кг")
}

date_magaz = {
    (1, "Порфиль", "Днепровский", "89004567845"),
    (2, "Сигизмун", "Версалькое шоссе", "89007894564"),
    (3, "Ваш выбор", "Фыпское 6", "89995554411"),
    (4, "Новый новый", "Рыскус 10/1", "8945612744"),
    (5, "Неваш", "Вырбургвсый", "89774562147"),
    (6, "Солями", "Питрегоское 33", "896544563223"),
    (7, "Йурской", "Хахавичское 32/21", "89774445566"),
    (8, "Какбабув", "Ладыжское начало д5", "89654569878"),
    (9, "Старая бабка", "Вурвур 4/2б ", "89635212554"),
    (10, "Хачатур", "Соподжон литрес 43", "8901200000")
}

date_zayvka = {
    (1, 1, "2021-10-10"),
    (2, 2, "2021-11-11"),
    (3, 2, "2022-12-12"),
    (4, 3, "2020-01-12"),
    (5, 3, "2020-04-12"),
    (6, 4, "2023-12-12"),
    (7, 7, "2023-01-01"),
    (8, 8, "2023-08-08"),
    (9, 10, "2023-09-07"),
    (10, 1, "2023-03-03")
    
}

date_kol = {
    (1, 1, 1, 10000000000),
    (2, 2, 3, 1132),
    (3, 3, 2, 432),
    (4, 4, 4, 5000),
    (5, 5, 5, 848484),
    (6, 6, 6, 100),
    (7, 7, 7, 800),
    (8, 8, 8, 900),
    (9, 9, 9, 1215),
    (10, 10, 10, 7896)
}

date_sostav = {
    (1, 1, 1, 50),
    (2, 2, 1, 31),
    (3, 3, 3, 100),
    (4, 4, 4, 878),
    (5, 5, 4, 10),
    (6, 6, 6, 80),
    (7, 7, 7, 500),
    (8, 8, 8, 600),
    (9, 9, 2, 1000),
    (10, 10, 10, 1100)
}
